{
  "title": "Предмети",
  "sections": [
    {
      "sectionTitle": "Загальні відомості",
      "sectionID": "subjects01",
      "blocks": [
        {
          "blockTitle": "Загалом сторінка для створення предметів має вигляд",
          "items": [
            {
              "type": "image",
              "url": "img01.jpg",
              "caption": "Скр. 1"
            },
            {
              "type": "text",
              "value": "Сторінка складається з:"
            },
            {
              "type": "list",
              "children": [
                "логотип компанії у лівому верхньому кутку",
                "основна навігація зліва під логотипом",
                "основні відомості про користувача, який зараз знаходиться на сайті (аватар та повне ім’я) у хедері сайту зліва",
                "вибір мови та кнопка виходу з профілю у хедері сайту справа",
                "основний контент, що складається з:",
                [
                  "назва поточної сторінки у темно-сірому блоці зліва",
                  "кнопка створення нового основного предмету у темно-сірому блоці справа",
                  "фільтр пошуку для списку основних предметів (пошук здійснюється за українською, російською та англійськими назвами основних предметів)",
                  "список основних предметів"
                ]
              ]
            }
          ]
        }
      ]
    },
    {
      "sectionTitle": "Робота зі сторінкою списку предметів",
      "sectionID": "subjects02",
      "blocks": [
        {
          "blockTitle": "Для створення основного предмету натискаємо на одну з кнопок “Створити предмет”:",
          "items": [
            {
              "type": "image",
              "url": "img02.jpg",
              "caption": "Скр. 2"
            }
          ]
        },
        {
          "blockTitle": "На сторінці з’явиться попап (Скр. 3) з трьома полями вводу назви основного предмету українською, російською та англійською мовами. Кнопка “Створити” буде відключена, поки не буде введено жодного варіанту назви. Обов’язковою є лише назва українською мовою; якщо не будуть введені назви російською та англійською, усюди буде показуватися тільки назва українською.",
          "items": [
            {
              "type": "text",
              "url": "Після вводу назви кнопка “Створити” стає активною, можна її натиснути і новий основний предмет буде занесено до бази даних (Скр. 3)"
            },
            {
              "type": "image",
              "url": "img03.jpg",
              "caption": "Скр. 3"
            },
            {
              "type": "image",
              "url": "img04.jpg",
              "caption": "Скр. 4"
            }
          ]
        },
        {
          "blockTitle": "Після створення одного, або декількох основних предметів у контенті сторінки буде відображатися список цих основних предметів у вигляді дерева файлів (Скр. 5). Якщо натиснути лівою кнопкою миші на один з основних предметів, станеться наступне (Скр. 6):",
          "items": [
            {
              "type": "list",
              "children": [
                "обраний основний предмет стане активним, буде показаний список предметів цього основного предмету (або напис “Нічого не знайдено”, якщо предмети ще не створені)",
                "інші основні предмети стануть напівпрозорими, але не відключеними, т.ч. з ними можна буде продовжувати працювати",
                "у темному блоці над списком основних предметів з’являться бредкрамби, за якими можна здійснювати навігацію по основним предметам, предметам, тощо"
              ]
            },
            {
              "type": "image",
              "url": "img05.jpg",
              "caption": "Скр. 5"
            },
            {
              "type": "image",
              "url": "img06.jpg",
              "caption": "Скр. 6"
            }
          ]
        },
        {
          "blockTitle": "Створений основний предмет можна редагувати (Скр. 7), видалити (Скр. 8), у ньому можна створити предмети (Скр. 9).",
          "items": [
            {
              "type": "image",
              "url": "img07.jpg",
              "caption": "Скр. 7"
            },
            {
              "type": "image",
              "url": "img08.jpg",
              "caption": "Скр. 8"
            },
            {
              "type": "image",
              "url": "img09.jpg",
              "caption": "Скр. 9"
            },
            {
              "type": "text",
              "value": "Для виводу цього контекстного меню необхідно натиснути правою кнопкою миші на обраному основному предметі."
            },
            {
              "type": "text",
              "value": "Таким чином почергово створюються (пункти 2.1-2.4)"
            },
            {
              "type": "list",
              "children": ["основний предмет", "предмет", "модуль", "урок"]
            }
          ]
        },
        {
          "blockTitle": "Для видалення уроку правою кнопкою миші на обраному елементі визивається контекстне меню із відповідними варіантами дій. Перейти на сторінку уроку можна двома способами:",
          "items": [
            {
              "type": "list",
              "children": [
                "натиснути лівою кнопкою миші на уроку",
                "через контекстне меню, пункт “Редагувати урок” (Скр. 10)"
              ]
            },
            {
              "type": "image",
              "url": "img10.jpg",
              "caption": "Скр. 10"
            }
          ]
        }
      ]
    },
    {
      "sectionTitle": "Робота зі сторінкою уроку",
      "sectionID": "subjects03",
      "blocks": [
        {
          "blockTitle": "Контентна частина сторінки уроку має вигляд",
          "items": [
            {
              "type": "image",
              "url": "img11.jpg",
              "caption": "Скр. 11"
            },
            {
              "type": "text",
              "value": "Контент складається з:"
            },
            {
              "type": "oList",
              "children": [
                "кнопка збереження змін у контенті або у назві уроку (відключена, якщо немає ніяких змін)",
                "контент уроку з кнопкою “+” для додавання нових блоків інформації",
                "контрольні запитання по уроку з кнопкою “+” для додавання нових блоків інформації і варіантів відповідей (контрольні запитання необов’язкові для створення)",
                "інформація про урок, наразі назва українською, російською та англійською мовами"
              ]
            }
          ]
        },
        {
          "blockTitle": "Для створення нового блоку інформації у контенті необхідно натиснути кнопку “+”, після чого на сторінці з’явиться попап (Скр. 12) з варіантами блоків (наразі текст, медіа, лінія, сторінка).",
          "items": [
            {
              "type": "image",
              "url": "img12.jpg",
              "caption": "Скр. 12"
            }
          ]
        },
        {
          "blockTitle": "Текстовий блок інформації (Скр. 12, Скр. 13) має вигляд wysiwyg редактора з елементами редагування зліва від блоку. Для видалення блоку використовується кнопка з іконкою смітника (Скр. 13). Цей блок призначений для створення будь-якого суто текстового контенту.",
          "items": [
            {
              "type": "image",
              "url": "img13.jpg",
              "caption": "Скр. 13"
            }
          ]
        },
        {
          "blockTitle": "Блок інформації “Медіа” (Скр. 14, Скр. 15) призначений для виводу на сторінці уроку зображень.",
          "items": [
            {
              "type": "image",
              "url": "img14.jpg",
              "caption": "Скр. 14"
            },
            {
              "type": "image",
              "url": "img15.jpg",
              "caption": "Скр. 15"
            },
            {
              "type": "text",
              "value": "Блок “Медіа” складається з:"
            },
            {
              "type": "list",
              "children": [
                "зображення (або плейсхолдера у випадку, якщо зображення ще не було завантажено)",
                "підпису зображення (необов’язкове поле)",
                "елементів керування блоком з кнопками “налаштування” та “видалення”"
              ]
            },
            {
              "type": "text",
              "value": "Для того, щоби завантажити зображення необхідно натиснути лівою кнопкою миші на плейсхолдері та обрати необхідний файл. Так само для заміни зображення необхідно натиснути на вже завантажене зображення і обрати інший файл."
            },
            {
              "type": "pText",
              "value": "Важливо! Усі зображення мають бути оптимізовані для Web, розмір одного зображення не має перевищувати 1MB, інакше неможливо буде зберегти зміни на сторінці."
            },
            {
              "type": "text",
              "value": "Зображення за замовчуванням буде мати розміри 16*9. Можливі також варіанти 3*4 та 1*1, які можна обрати, натиснувши кнопку “налаштування” зліва від блока інформації. Блок буде перекритий попапом з усіма налаштуваннями для цього блоку (Скр. 16). Натиснувши на один із варіантів розмірів зображення змінить свій зовнішній вигляд і можна буде закривати попап, ще раз натиснувши на кнопку “налаштування”."
            },
            {
              "type": "image",
              "url": "img16.jpg",
              "caption": "Скр. 16"
            }
          ]
        },
        {
          "blockTitle": "Блоки “Лінія” і “Сторінка” (Скр. 17, Скр. 18) слугують для розділення контенту уроку. “Лінія” створить сіру горизонтальну лінію між блоками інформації, “Сторінка” у редакторі створить чорну горизонтальну лінію між блоками, а учень буде бачити розбивку на сторінки у тому місці, де будуть знаходиться ці блоки.",
          "items": [
            {
              "type": "image",
              "url": "img17.jpg",
              "caption": "Скр. 17"
            },
            {
              "type": "image",
              "url": "img18.jpg",
              "caption": "Скр. 18"
            }
          ]
        },
        {
          "blockTitle": "Для кожного уроку можна створити контрольні запитання, з метою оцінити розуміння учнем інформації і виставленням йому оцінки за урок. Текст запитання, або зображення з запитанням створюються у розділі сторінки “Контрольні запитання” за прикладом пунктів 3.2-3.4. Також є можливість розділяти блоки лінією, або переносити блоки на наступні сторінки (дивись пункт 3.5).",
          "items": [
            {
              "type": "text",
              "value": "Для створення блоку відповідей на поставлене запитання необхідно у  розділі сторінки “Контрольні запитання” натиснути на кнопку “+” і обрати тип блоку “Відповіді” (Скр. 19)."
            },
            {
              "type": "image",
              "url": "img19.jpg",
              "caption": "Скр. 19"
            },
            {
              "type": "text",
              "value": "Блок “Відповіді” має вигляд:"
            },
            {
              "type": "image",
              "url": "img20.jpg",
              "caption": "Скр. 20"
            },
            {
              "type": "text",
              "value": "І складається з:"
            },
            {
              "type": "oList",
              "children": [
                "кнопка видалення варіанту відповіді",
                "кнопка створення нового варіанту відповіді",
                "текстове поле з правильними відповідями (у разі єдиної правильної відповіді має мати вигляд типу “1” без скобок, у разі декількох правильних відповідей має мати вигляд типа “1, 3” без скобок)",
                "текстове поле з балами за правильну відповідь на запитання з цього блоку інформації",
                "максимальний бал завжди знаходиться з верхнього правого краю і є сумою балів за правильні відповіді по всім блокам інформації"
              ]
            },
            {
              "type": "text",
              "value": "Загалом питання і варіанти відповідей мають виглядати накшталт:"
            },
            {
              "type": "image",
              "url": "img21.jpg",
              "caption": "Скр. 21"
            },
            {
              "type": "text",
              "value": "Де запитання записане у блоку інформації “Текст”, а блок інформації “Відповіді” має декілька заповнених варіантів відповідей а також заповнені поля “Правильні відповіді” та “Бал за правильну відповідь”."
            }
          ]
        }
      ]
    }
  ]
}
